# config.py

PROPERTY_TYPES = ['คอนโด','บ้าน'] #, 'ทาวน์โฮม', 'อพาร์ตเมนต์', 'พูลวิลล่า','ทั้งหมด','บ้าน'
TARGET_ZONES = ['ราษฎร์บูรณะ']#'สุขุมวิท', 'พระโขนง', 'อ่อนนุช', 'สำโรง', แบริ่ง', 'ปุณณวิถี'

# จำนวนรอบลองสุ่มใหม่กรณีที่ไม่พบข้อมูล
MAX_RETRIES = 3

# ตั้งค่าการแสดงผลเบราว์เซอร์ (True = เปิดหน้าจอ, False = รันเบื้องหลัง)
SHOW_BROWSER = True

# Debug mode: True = Save to Google Sheets, False = Save to Agent API
DEBUG_MODE = True

# จำนวนรายการทรัพย์สินสูงสุดที่จะดึงต่อการรอบการค้นหา
MAX_ITEMS_PER_RUN = 9999

# คำที่ต้องการข้ามถ้าเจอในกล่องวันที่อัพเดท (เพื่อไม่คลิกเข้าไปอ่านให้ดึงแค่ข้อมูลใหม่จริงๆ)
SKIP_KEYWORDS = []#'ดัน', 'สร้าง', 'อัปเดต'

# เพดานราคาสูงสุดของอสังหาฯ แต่ละประเภท (ดึงไปกรองข้อมูลก่อนเข้าหน้า Detail)
MAX_PRICE_LIMITS = {
    'บ้าน': 10000000,
    'คอนโด': 5000000
}

# แมพปิ้งข้อมูลสำหรับส่งเข้า Agent API
DATA_MAPPING = {
    "directions": {
        "เหนือ": 1,
        "ใต้": 2,
        "ตะวันออก": 3,
        "ตะวันตก": 4,
        "ตะวันออกเฉียงเหนือ": 5,
        "ตะวันออกเฉียงใต้": 6,
        "ตะวันตกเฉียงเหนือ": 7,
        "ตะวันตกเฉียงใต้": 8,
        "ไม่ระบุทิศ": 8
    },
    "furnishings": {
        "โนเฟอร์": 1,
        "เฟอร์นิเจอร์บางส่วน": 2,
        "เฟอร์นิเจอร์ครบ": 3,
        "ไม่ระบุ": 4
    },
    "rooms": {
        "สตูดิโอ": 14,
        "1นอน": 1,
        "2นอน": 2,
        "3นอน": 3,
        "4นอน": 4,
        "5นอน": 12,
        "1น้ำ": 1,
        "2น้ำ": 2,
        "3น้ำ": 3,
        "ไม่ระบุ": 13
    }
}
